# 資料: 程式的基本單位 (若輸入的程式碼皆正確, 則在終端機(terminal)輸入後可執行, 若亂寫文字及符號, 則會出現 Error)
# 數字
3456
3.5
# 字串: 在雙引號中可輸入任意文字, 不受語法限制
"測試中文"
"Hello World"
# 布林值: 可以任意寫的兩個文字, 分別代表圈及叉
True
False
# 有順序、可動的列表 List: 在中括號中用逗號隔開不同的資料, 把它裝成一個集合/列表/整體/容器, 有區分順序, 列表最前端就是第一個
[3,4,5]
["Hello","World"]
# 有順序、不可動的列表 Tuple: 在小括號中用逗號隔開不同的資料, 把它裝成一個集合/列表/整體/容器, 有區分順序, 列表最前端就是第一個 
(3,4,5)
("Hello","World")
# 集合 Set: 在大括號中用逗號隔開隔開不同的資料, 把它裝成一個集合, 沒有區分排序, 沒有分誰是第一個
{3,4,5}
{"Hello","World"}
# 字典 Dictionary: 鍵跟值的配對
{"apple":"蘋果","data":"資料"}
# 變數: 用來儲存資料的自訂名稱 (開頭不可以是數字), 並且有彈性 (可以隨時替換資料)
# 變數名稱=資料: 把資料放到名字中
x=3
# print(資料): 把資料印出來
print(x)
x=True # 取代舊的資料 (可隨時切換/替代)
print(x)
x="Hello"
print(x)
x={3,5,6} # 集合 set
print(x)