# 數字運算
x=3+6
print(x)
x=7/6 # 小數除法(/), 除不盡會有小數點
print(x)
x=7//6 # 整數除法(//), 捨去小數點
print(x)
x=2**0.5 # 次方(**), 開根號(**0.5)
print(x)
x=7%3 # 餘數(%)
print(x)
x=2+3
print(x)
x+=1 # x=x+1, 先看等號(=)後方, 將變數中的數字+1
x-=1 # x=x-1, 先看等號(=)後方, 將變數中的數字-1
x*=1 # x=x*1, 先看等號(=)後方, 將變數中的數字*1
x/=1 # x=x/1, 先看等號(=)後方, 將變數中的數字/1
print(x)
# 字串運算
s="Hello" # (字串單引號('')或雙引號("")都可以)
print(s)
s="Hell\"o" # 雙引號("")前打斜線(\), 代表跳脫, 與外面的雙引號做區隔
print(s)
s="Hello"+"World" # 字串串接使用加號(+)或空白( )
print(s)
s="Hello" "World"
print(s)
s="Hello\nWorld" # \n 代表換行
print(s)
s="""Hello


World""" # 連續用三個雙引號("""字串""")或單引號('''字串''')可以直接換行, 換幾行都會直接被反映出來, 可寫多行文字
print(s)
s="Hello"*3 # 乘號(*)可以直接將前面的文字重複
print(s)
s="Hello"*3+"World" # 先乘除後加減
print(s)
# 字串會對內部的字元編號(索引), 從 0 開始算起
# "Hello"
# "01234"
s="Hello"
print(s[0]) # 字串[編號]: 可以看到字串中第幾個編號的字元
print(s[1:4]) # 字串[開頭編號:結束編號]: 可以看到字串中包含開頭不包含結尾編號的字元 (子字串)
print(s[1:]) # 字串[開頭編號:]: 可以看到字串中包含開頭編號一直到最後的所有字元 (子字串)
print(s[:4]) # 字串[:結束編號]: 可以看到字串中不包含結尾編號, 在它之前的所有字元 (子字串)

x="Hello "*3+"World"
print(x)

x="Hello"*3+"\n"+"World"
print(x)